# class FishBread:
#     shape  = str()
#     banjuk = str()
#     angko  = str()
#     candy  = int()
#
#     def bake(self, time):
#         complete_time = time * 60;
#         return True
#
#     def revese(self, counts):
#         for count in range(counts):
#             print(count, '회 뒤집기')

class 빵틀:
    모양 = str()    # 붕어, 잉어
    반죽 = ''    # 밀가루, 찹쌀가루, 쌀가루
    앙꼬 = ''    # 팥, 슈크림, 매콤
    별사탕 = int()

    def 굽기(self, 분):
        완성시간 = 분 * 60
        return 완성시간

    def 뒤집기(self, 횟수):
        for 카운터 in range(횟수):
            print(카운터+1, '회 뒤집기')


붕어빵_01 = 빵틀()
붕어빵_02 = 빵틀()

붕어빵_01.모양 = '붕어'
붕어빵_01.반죽 = '밀가루'
붕어빵_01.앙꼬 = '팥'
붕어빵_01.별사탕 = 10

시간1 = 붕어빵_01.굽기(3)
#횟수1 = 붕어빵_01.뒤집기(2)

붕어빵_02.모양 = '잉어'
붕어빵_02.반죽 = '찹쌀가루'
붕어빵_02.앙꼬 = '슈크림'
붕어빵_02.별사탕 = 20

시간2 = 붕어빵_02.굽기(5)
#횟수2 = 붕어빵_02.뒤집기(4)


print('\n### 붕어빵1 확인')
print('붕어빵1이 만들어지는데 ', 시간1, '초가 걸렸습니다.')
print('붕어빵1의 앙꼬는 ', 붕어빵_01.앙꼬, ' 입니다.')


print('\n### 붕어빵2 확인')
print('붕어빵2이 만들어지는데 ', 시간2, '초가 걸렸습니다.')
print('붕어빵2의 앙꼬는 ', 붕어빵_02.앙꼬, ' 입니다.')
붕어빵_02.뒤집기(5)
